Repository: quarkusio/pt.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: pt_br

source: To create a Gradle project, add the `--gradle` or `--gradle-kotlin-dsl` option.
pt_br: Para criar um projeto Gradle, adicione a opção `--gradle` ou `--gradle-kotlin-dsl`.

source: To create a Gradle project, add the `-DbuildTool=gradle` or `-DbuildTool=gradle-kotlin-dsl` option.
pt_br: Para criar um projeto Gradle, adicione a opção '-DbuildTool=gradle' ou '-DbuildTool=gradle-kotlin-dsl'.

source: To deploy a native executable, you must build it with GraalVM.
pt_br: Para fazer o deploy de um executável nativo, é necessário compilá-lo com o GraalVM.

source: To deploy to AWS Lambda:
pt_br: Para fazer o deploy no AWS Lambda:

source: To enable client xDS, use the following configuration.
pt_br: Para ativar o xDS do cliente, utilize a seguinte configuração:

source: To enable server xDS, use the following configuration.
pt_br: Para habilitar o servidor xDS, utilize a seguinte configuração:

source: To enable this security feature, add this to your `application.properties` file:
pt_br: Para ativar esta funcionalidade de segurança, adicione isto ao seu arquivo `application.properties`:

source: To get started with security in Quarkus, consider combining the Quarkus built-in Basic HTTP authentication with the Jakarta Persistence identity provider to enable role-based access control (RBAC).
pt_br: Para começar a utilizar o security no Quarkus, considere a possibilidade de combinar a autenticação HTTP básica integrada no Quarkus com o Jakarta Persistence identity provider para permitir o role-based access control(RBAC).

source: To increment a value, run the following command:
pt_br: Para incrementar um valor, execute o seguinte comando:

source: To learn more about the Quarkus Redis extension, check xref:redis-reference.adoc[the Redis extension reference guide].
pt_br: Para saber mais sobre a extensão Quarkus Redis, consulte xref:redis-reference.adoc[o guia de referência da extensão Redis].

source: To learn more about the internal design and choices, check the https://dl.acm.org/doi/10.1145/3583678.3596895[Considerations for integrating virtual threads in a Java framework: a Quarkus example in a resource-constrained environment] paper.
pt_br: Para saber mais sobre o design interno e as escolhas, consulte o documento https://dl.acm.org/doi/10.1145/3583678.3596895[Considerações sobre a integração de threads virtuais numa estrutura Java: um exemplo Quarkus num ambiente com recursos limitados].

source: To optimize your application for Lambda SnapStart, check xref:amazon-snapstart.adoc[the SnapStart Configuration Documentation].
pt_br: Para otimizar a sua aplicação para o Lambda SnapStart, consulte link:amazon-snapstart.html[a documentação de configuração do SnapStart].

source: To retrieve an increment using its key, we will have to run the below command:
pt_br: Para recuperar um incremento utilizando a sua chave, teremos de executar o comando abaixo:

source: To see the `GreetingResourceIT` run against the native executable, use `./mvnw verify -Dnative`:
pt_br: Para ver o `GreetingResourceIT` ser executado no executável nativo, utilize `./mvnw verify -Dnative`:

source: To see the list of current increments keys, run the following command:
pt_br: Para ver a lista de chaves de incrementos atuais, execute o seguinte comando:

source: To turn off the mock event server:
pt_br: Para desativar o mock event server:

source: To use GraalVM CE instead of Mandrel, update the `FROM` clause to: `FROM quay.io/quarkus/ubi-quarkus-graalvmce-builder-image:{graalvm-flavor} AS build`.
pt_br: Para usar o GraalVM CE em vez do Mandrel, atualize o trecho `FROM` para: `FROM quay.io/quarkus/ubi-quarkus-graalvmce-builder-image:{graalvm-flavor} AS build`.

source: To work around the current known issue of link:https://issues.redhat.com/browse/AG-209[Agroal having a different view on running transaction checks], set the datasource transaction type for the datasource responsible for writing the transaction logs to `disabled`:
pt_br: Para contornar o problema conhecido atual de link:https://issues.redhat.com/browse/AG-209[Agroal tendo uma exibição diferente sobre a execução de verificações de transação], defina o tipo de transação de fonte de dados para a fonte de dados responsável por gravar os logs de transação como 'disabled':

source: To write duration values, use the standard `java.time.Duration` format. See the link:https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/time/Duration.html#parse(java.lang.CharSequence)[Duration#parse() javadoc] for more information.
pt_br: Para valores de duração, use o formato padrão 'java.time.Duration'. Consulte o link:https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/time/Duration.html#parse(java.lang.CharSequence)[Duration#parse() javadoc] para obter mais informações.

source: Today’s users embrace applications with milliseconds of response time, 100% uptime, lower latency, push data instead of pull, higher throughput, and elasticity. However, these features are nearly impossible to achieve using yesterday’s software architecture without a considerable investment in resources, infrastructure, and tooling. The world changed, and having dozens of servers, long response times (&gt; 500 ms), downtime due to maintenance or waterfalls of failures does not meet the expected user experience.
pt_br: Os usuários de hoje adotam aplicações com milissegundos de tempo de resposta, disponibilidade de 100%, menor latência, dados por push em vez de pull, maior taxa de transferência e elasticidade. No entanto, esses recursos são quase impossíveis de alcançar usando a arquitetura de software de ontem sem um investimento considerável em recursos, infraestrutura e ferramentas. O mundo mudou, e ter dezenas de servidores, longos tempos de resposta (&gt; de 500 ms), tempo de inatividade devido a manutenção ou cascatas de falhas não atende à experiência esperada do usuário.

source: Tooling
pt_br: Ferramentas

source: Topic auto discovery period when using a pattern for topic's consumer. The default and minimum value is 1 minute.
pt_br: Período de descoberta automática de tópicos ao usar um padrão para o consumidor do tópico. O valor padrão e mínimo é 1 minuto.

source: Topic name
pt_br: Nome do tópico

source: Topic pattern
pt_br: Padrão de tópico

source: Tracing & Debugging
pt_br: Rastreamento & Depuração

source: Tracing with AWS XRay and GraalVM
pt_br: Tracing com AWS XRay e GraalVM

source: Traditional Java stacks were engineered for monolithic applications with long startup times and large memory requirements in a world where the cloud, containers, and Kubernetes did not exist. Java frameworks needed to evolve to meet the needs of this new world.
pt_br: As stacks Java tradicionais foram projetadas para aplicativos monolíticos com longos tempos de inicialização e grandes requisitos de memória em um mundo em que a nuvem, os contêineres e o Kubernetes não existiam. Os frameworks Java precisavam evoluir para atender às necessidades desse novo mundo.

source: Transaction Configuration
pt_br: Configuração de transações

source: Transactional and Idempotent producers support
pt_br: Suporte aos producers transacionais e idempotentes

source: Trigger the inclusion on additional extensions based on certain conditions.
pt_br: Acione a inclusão de extensões adicionais com base em determinadas condições.

source: Type
pt_br: Tipo

source: UBI images can be used without any limitations.
pt_br: As imagens UBI podem ser utilizadas sem qualquer limitações.

source: URL of proxy service. proxyServiceUrl and proxyProtocol must be mutually inclusive.
pt_br: URL do serviço de proxy. proxyServiceUrl e proxyProtocol devem ser mutuamente inclusivos.

source: Understanding the Platform concept
pt_br: Entendendo o conceito de Plataforma

source: Unified Config
pt_br: Configuração unificada

source: Unified configuration
pt_br: Configuração unificada

source: Unifies Imperative and Reactive
pt_br: Unifica o imperativo e o reativo

source: Unifies imperative and reactive
pt_br: Unifica imperativo e reativo

source: Update projects to the latest Quarkus version
pt_br: Atualizando projetos para a versão mais recente do Quarkus

source: Use Apache Kafka, Avro serialized records, and connect to a schema registry.
pt_br: Use o Apache Kafka, Avro serialized records e conecte-se a um Schema Registry.

source: Use ConfigMaps as a configuration source for your Quarkus applications.
pt_br: Use ConfigMaps como uma fonte de configuração para seus aplicativos Quarkus.

source: Use Kogito to add DRL files with rules.
pt_br: Use o Kogito para adicionar arquivos DRL com regras.

source: Use Kogito to add business automation and power it up with DMN decision support.
pt_br: Use o Kogito para adicionar automação comercial e aprimorá-la com o suporte a decisões DMN.

source: Use Kogito to add business automation to power it up with predictions.
pt_br: Use o Kogito para adicionar automação comercial para potencializá-lo com previsões.

source: Use Podman instead of Docker for running containers.
pt_br: Use o Podman em vez do Docker para executar contêineres.

source: Use Quarkus to build a Kafka Streams Application.
pt_br: Use o Quarkus para criar um aplicativo Kafka Streams.

source: Use Spring Boot's `@ConfigurationProperties` in place of MicroProfile Config annotations
pt_br: Use o '@ConfigurationProperties' do Spring Boot no lugar das anotações do MicroProfile Config

source: Use a diff tool to inspect all changes.
pt_br: Utilize uma ferramenta de comparação para inspecionar todas as alterações.

source: Use mutable jars to rebuild your application with different build time configurations.
pt_br: Use JARs mutáveis para reconstruir sua aplicação com diferentes configurações de tempo de compilação.

source: Use platform-specific install tools like https://sdkman.io/jdks#Oracle[sdkman], https://github.com/graalvm/homebrew-tap[homebrew], or https://github.com/ScoopInstaller/Java[scoop].
pt_br: Use ferramentas de instalação específicas, como link:https://sdkman.io/jdks#Oracle[sdkman], link:https://github.com/graalvm/homebrew-tap[homebrew] ou link:https://github.com/ScoopInstaller/Java[scoop].

source: Use the <a href="https://github.com/quarkusio/quarkus/discussions">Discussions</a> section on our GitHub project.
pt_br: Use a seção <a href="https://github.com/quarkusio/quarkus/discussions">Discussões</a> em nosso projeto GitHub.

source: Use the Quarkus CLI to create, build, run, and manage extensions for Quarkus projects.
pt_br: Use a CLI do Quarkus para criar, compilar, executar e gerenciar extensões para projetos Quarkus.

source: Use the Quarkus Spring Data REST compatibility layer to create a sample CRUD application.
pt_br: Use a camada de compatibilidade REST do Quarkus Spring Data para criar um aplicativo CRUD de exemplo.

source: Use the Redis backend
pt_br: Utilizar o Redis como backend

source: Use the command below, to delete an increment given its key.
pt_br: Utilize o comando abaixo, para excluir um incremento dada a sua chave.

source: Use the docker image from the file `native-builder.image`.
pt_br: Utilize a imagem docker do arquivo `native-builder.image`.

source: Use the duplicated context in virtual threads
pt_br: Utilize o contexto duplicado em threads virtuais

source: Use the following command to recursively delete the `com.apple.quarantine` extended attribute on the GraalVM install directory as a workaround:
pt_br: Use o seguinte comando para excluir recursivamente o atributo estendido `com.apple.quarantine` no diretório de instalação do GraalVM como uma solução alternativa:

source: Use this configuration to automatically create an initial subscription when creating a topic. If this field is not set, the initial subscription is not created.
pt_br: Use essa configuração para criar automaticamente uma assinatura inicial ao criar um tópico. Se esse campo não estiver definido, a assinatura inicial não será criada.

source: Use virtual thread friendly clients
pt_br: Utilize clientes compatíveis com threads virtuais

source: Use worker thread (limit concurrency)
pt_br: Utiliza worker thread (limita a concorrência)

source: User name of SOCKS5 proxy.
pt_br: Nome de usuário do proxy SOCKS5.

source: Using AI to optimize a schedule with OptaPlanner
pt_br: Usando IA para otimizar um cronograma com o OptaPlanner

source: Using AMQP with Reactive Messaging
pt_br: Usando AMQP com mensagens reativas

source: Using Apache Kafka Streams
pt_br: Usando Apache Kafka Streams

source: Using Apache Kafka with Schema Registry and Avro
pt_br: Utilização do Apache Kafka com o Schema Registry e o Avro

source: Using Blaze-Persistence
pt_br: Usando o Blaze-Persistence

source: Using Fault Tolerance
pt_br: Usando tolerância a falhas

source: Using HTTP with Reactive Messaging
pt_br: Usando HTTP com mensagens reativas

source: Using HashiCorp Vault with Databases
pt_br: Usando o HashiCorp Vault com bancos de dados

source: Using HashiCorp Vault’s PKI Secret Engine
pt_br: Usando o PKI Secret Engine do HashiCorp Vault

source: Using Health Check
pt_br: Usando Health Check

source: Using Hibernate ORM and JPA
pt_br: Usando Hibernate ORM e JPA

source: Using Hibernate Reactive
pt_br: Usando o Hibernate Reactive

source: Using Infinispan Client
pt_br: Usando o cliente Infinispan

source: Using JMS
pt_br: Usando JMS

source: Using JWT RBAC
pt_br: Usando JWT RBAC

source: Using Kogito DMN support to add decision automation capabilities to an application
pt_br: Usando o suporte ao Kogito DMN para adicionar recursos de automação de decisões a um aplicativo

source: Using Kogito to add business automation capabilities to an application
pt_br: Usando o Kogito para adicionar recursos de automação comercial a um aplicativo

source: Using Kogito to add prediction capabilities to an application
pt_br: Usando o Kogito para adicionar recursos de previsão a um aplicativo

source: Using Kogito to add rule engine capabilities to an application
pt_br: Usando o Kogito para adicionar recursos de mecanismo de regras a um aplicativo

source: Using Kotlin
pt_br: Usando Kotlin

source: Using LRA (Long Running Actions)
pt_br: Usando LRA (Ações de Longa Duração)

source: Using Maven
pt_br: Utilizando o Maven

source: Using Monitoring Options
pt_br: Utilizar as opções de monitoração

source: Using OAuth2 RBAC
pt_br: Usando OAuth2 RBAC

source: Using OpenAPI and Swagger UI
pt_br: Utilizar OpenAPI e Swagger UI

source: Using OpenID Connect (OIDC) Multi-Tenancy
pt_br: Usando o OpenID Connect (OIDC) Multi-Tenancy

source: Using OpenID Connect (OIDC) and Keycloak to Centralize Authorizations
pt_br: Usando OpenID Connect (OIDC) e Keycloak para centralizar autorizações

source: Using OpenID Connect (OIDC) and OAuth2 Client and Filters
pt_br: Usando clientes e filtros OpenID Connect (OIDC) e OAuth2

source: Using OpenID Connect (OIDC) to Protect Service Applications
pt_br: Utilizar o OpenID Connect (OIDC) para proteger aplicações de serviço

source: Using OpenID Connect (OIDC) to Protect Web Applications
pt_br: Usando o OpenID Connect (OIDC) para proteger aplicativos Web

source: Using OpenTelemetry
pt_br: Usando OpenTelemetry

source: Using OpenTracing
pt_br: Usando o OpenTracing

source: Using Podman
pt_br: Usando o Podman

source: Using Quarkus CLI
pt_br: Utilizando o Quarkus CLI

source: Using RabbitMQ with Reactive Messaging
pt_br: Usando o RabbitMQ com mensagens reativas

source: Using Reactive Routes
pt_br: Usando rotas reativas

source: Using SSL With Native Executables
pt_br: Usando SSL com executáveis nativos

source: Using Security with .properties File
pt_br: Usando a segurança com o arquivo .properties

source: Using Security with JDBC
pt_br: Usando a segurança com JDBC

source: Using Security with LDAP
pt_br: Usando a segurança com LDAP

source: Using Security with WebAuthn
pt_br: Usando a segurança com WebAuthn

source: Using Sentry to Monitor your Logs
pt_br: Utilizar o Sentry para monitorizar os seus registos

source: Using Software Transactional Memory
pt_br: Usando a memória transacional de software

source: Using Spring Boot's ConfigurationProperties
pt_br: Usando ConfigurationProperties do Spring Boot

source: Using Stork with Kubernetes
pt_br: Usando o Stork com o Kubernetes

source: Using Transactions
pt_br: Usando transações

source: Using Transactions in Quarkus
pt_br: Usando transações no Quarkus

source: Using Vault
pt_br: Usando o Vault

source: Using Vault Transit Secret Engine
pt_br: Usando o Vault Transit Secret Engine

source: Using Vert.x
pt_br: Usando o Vert.x

source: Using WebSockets
pt_br: Usando WebSockets

source: Using WebSockets with Reactive Messaging
pt_br: Usando WebSockets com mensagens reativas

source: Using `@TransactionScoped` to bind CDI beans to the transaction lifecycle
pt_br: Utilizar `@TransactionScoped` para ligar beans CDI ao ciclo de vida da transação

source: Using a Distroless base image
pt_br: Usando uma imagem base sem distribuição

source: Using a local GraalVM installation
pt_br: Usando uma instalação local do GraalVM

source: Using a multi-stage Docker build
pt_br: Utilizar uma compilação do Docker multi-stage

source: Using an in-container build
pt_br: Usando uma compilação em contêiner

source: Using our Tooling
pt_br: Usando nossas ferramentas

source: Using the Kubernetes Client to Interact with a Kubernetes Cluster
pt_br: Usando o Kubernetes Client para interagir com um cluster Kubernetes

source: Using the Quarkus CLI
pt_br: Usando a CLI do Quarkus

source: Using the Quarkus Extension for Spring Cache
pt_br: Usando a extensão Quarkus para Spring Cache

source: Using the Quarkus Extension for Spring Cloud Config
pt_br: Usando a extensão Quarkus para o Spring Cloud Config

source: Using the Quarkus Extension for Spring DI API
pt_br: Usando a extensão Quarkus para a API do Spring DI

source: Using the Quarkus Extension for Spring Data JPA API
pt_br: Usando a extensão Quarkus para a API JPA do Spring Data

source: Using the Quarkus Extension for Spring Scheduled
pt_br: Usando a extensão Quarkus para Spring Scheduled

source: Using the Quarkus Extension for Spring Security API
pt_br: Usando a extensão Quarkus para a Spring Security API

source: Using the Quarkus Extension for Spring Web API
pt_br: Usando a extensão Quarkus para Spring Web API

source: Using the Quarkus Kubernetes extension, developers can perform or automate a single-step deployment using Jib, Docker, and Source-to-Image (S2i) including the creation of DeploymentConfig to trigger automatic redeployments. <a href="{{site.baseurl}}/guides/deploying-to-kubernetes">Read the guide for more details.</a>
pt_br: Usando a extensão Quarkus Kubernetes, os desenvolvedores podem executar ou automatizar uma implantação de etapa única usando Jib, Docker e Source-to-Image (S2i), incluindo a criação de DeploymentConfig para disparar reimplantações automáticas. <a href="{{site.baseurl}}/guides/deploying-to-kubernetes">Leia o guia para obter mais detalhes.</a>

source: Using the REST Client (including JSON)
pt_br: Utilizar o cliente REST (incluindo JSON)

source: Using the REST Client with Multipart
pt_br: Utilizar o cliente REST com Multipart

source: Using the RESTEasy Classic REST Client (including JSON)
pt_br: Usando o cliente RESTEasy Classic REST (incluindo JSON)

source: Using the Redis Client
pt_br: Usando o cliente Redis

source: Using the container-image extensions
pt_br: Utilizar as extensões dos container-image

source: Using the event bus
pt_br: Utilizar o barramento de eventos

source: Using xDS gRPC
pt_br: Usando o xDS gRPC

source: Validation with Hibernate Validator
pt_br: Validação com o Hibernate Validator

source: Vert.x Reference Guide
pt_br: Guia de referência do Vert.x

source: Videos
pt_br: Vídeos

source: Virtual Thread support reference
pt_br: Referência de apoio para Threads Virtuais

source: Virtual Threads support
pt_br: Suporte a threads virtuais

source: Virtual thread
pt_br: Thread virtual

source: Virtual thread names
pt_br: Nomes de threads virtuais

source: Virtual threads are useful for I/O-bound workloads only
pt_br: As threads virtuais são úteis apenas para cargas de trabalho vinculadas a E/S

source: Visual Studio Code Extension For Quarkus
pt_br: Visual Studio Code Extension para Quarkus

source: Visualize and configure extensions as well as access to application logs and testing components
pt_br: Visualize e configure extensões, bem como acesso a logs de aplicativos e componentes de teste

source: Visualizing records
pt_br: Visualização de registros

source: Want to learn more? Check out the <a href='/guides/'>guides</a> to continue your journey.
pt_br: Quer saber mais? Confira os <a href='/guides/'>guias</a> para continuar sua jornada.

source: Want to learn more? Check out the <a href='https://quarkus.io/guides/'>guides</a> to continue your journey
pt_br: Quer saber mais? Confira os <a href='https://quarkus.io/guides/'>guias</a> para continuar sua jornada

source: We create the first increment, with the key `first` and an initial value of `10`.
pt_br: Criamos o primeiro incremento, com a chave `primeira` e um valor inicial de `10`.

source: We don’t want you to spend hours learning new technologies. Instead, the Quarkus programming model builds on top of proven standards. Be it official standards such as Eclipse MicroProfile or leading frameworks in a specific domain such as Eclipse Vert.x.
pt_br: Não queremos que você passe horas aprendendo novas tecnologias. Em vez disso, o modelo de programação do Quarkus se baseia em padrões comprovados. Sejam padrões oficiais, como o Eclipse MicroProfile, ou estruturas líderes em um domínio específico, como o Eclipse Vert.x.

source: We have a lot of documentation. Be sure to check our <a href="{{site.baseurl}}/get-started/">Getting started page</a>, and all our <a href="{{site.baseurl}}/guides/">guides</a>. Also check out our <a href="{{site.baseurl}}/faq/">FAQ section</a> and <a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVbMz1LJqc8L5LpnfxPPKloO">Quarkus Tips Playlist</a>
pt_br: Temos muita documentação. Certifique-se de verificar nossa <a href="{{site.baseurl}}/get-started/">página de Introdução</a> e todos os nossos <a href="{{site.baseurl}}/guides/">guias</a>. Confira também nossa <a href="{{site.baseurl}}/faq/">seção FAQ</a> e <a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVbMz1LJqc8L5LpnfxPPKloO">Quarkus Tips Playlist</a>

source: We pre-boot as many of the frameworks as possible during the native compilation of a Quarkus application. It means that the resulting native executable has already run most of the startup code and serialized the result into the executable: even faster startup!
pt_br: Nós pré-inicializamos o maior número possível de frameworks durante a compilação nativa de um aplicativo Quarkus. Isso significa que o executável nativo resultante já executou a maior parte do código de inicialização e serializou o resultado no executável: inicialização ainda mais rápida!

source: We recommend continuing the journey with the xref:deploying-to-kubernetes.adoc[deployment to Kubernetes and OpenShift].
pt_br: Recomendamos continuar a jornada com a link:deploying-to-kubernetes.html[implantação no Kubernetes e no OpenShift].

source: We recommend that you follow the instructions in the next sections and create the application step by step. However, you can go right to the completed example.
pt_br: Recomendamos que siga as instruções nas seções seguintes e crie a aplicação passo a passo. No entanto, você pode ir diretamente para o exemplo completo.

source: We recommend that you follow the instructions in the next sections and package the application step by step. However, you can go right to the completed example.
pt_br: Recomendamos que siga as instruções nos passos seguintes e que prepare a aplicação passo a passo. No entanto, pode ir diretamente para o exemplo completo.
